pranavshah101/Project_dspic33ep512mu810/PWM22.X/mcc_generated_files/pwm.h
    switch(genNum) { 
        case PWM_GENERATOR_1:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON1bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON1bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON1bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_2:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON2bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON2bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON2bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_3:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON3bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON3bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON3bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_4:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON4bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON4bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON4bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_5:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON5bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON5bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON5bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_GENERATOR_6:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON6bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON6bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON6bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        default:break;  
    }
	return status;
}

/**
  @Summary
    Sets the compare value in count for the Special Event Trigger from the Primary time base generator.

  @Description
    This routine is used to set the compare value in count for the Special Event Trigger from the Primary time base generator.

  @Param
    compareValue - Compare value in count.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t compareValue;

    compareValue = 0xFF;
    
    PWM_SpecialEventPrimaryCompareValueSet(compareValue);
    </code>
*/  
inline static void PWM_SpecialEventPrimaryCompareValueSet(uint16_t compareValue)
{
    SEVTCMP = compareValue;
}

/**
  @Summary
    Clears PWM Special Event Trigger interrupt request flag.

  @Description
    This routine is used to clear PWM Special Event Trigger interrupt request flag.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SpecialEventTriggerInterruptFlagClear();
    </code>
*/ 
inline static void PWM_SpecialEventTriggerInterruptFlagClear(void)
{
    IFS3bits.PSEMIF = false;
}

/**
  @Summary
    Enables interrupt request for Special Event Trigger from the Primary time base generator.

  @Description
    This routine is used to enable interrupt request for Special Event Trigger from the Primary time base generator.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SpecialEventPrimaryInterruptEnable();
    </code>
*/  
inline static void PWM_SpecialEventPrimaryInterruptEnable(void)
{
	PTCONbits.SEIEN = true; 
}

/**
  @Summary
    Disables interrupt request for Special Event Trigger from the Primary time base generator.

  @Description
    This routine is used to disable interrupt request for Special Event Trigger from the Primary time base generator.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SpecialEventPrimaryInterruptDisable();
    </code>
*/  
inline static void PWM_SpecialEventPrimaryInterruptDisable(void)
{
	PTCONbits.SEIEN = false; 
}

/**
  @Summary
    Enables PWM latched fault mode for the PWM Generator.

  @Description
    This routine is used to enable PWM latched fault mode for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_FaultModeLatchEnable(genNum);
    </code>
*/ 
inline static void PWM_FaultModeLatchEnable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                FCLCON1bits.FLTMOD = 0x0;
                break;       
        case PWM_GENERATOR_2:
                FCLCON2bits.FLTMOD = 0x0;
                break;       
        case PWM_GENERATOR_3:
                FCLCON3bits.FLTMOD = 0x0;
                break;       
        case PWM_GENERATOR_4:
                FCLCON4bits.FLTMOD = 0x0;
                break;       
        case PWM_GENERATOR_5:
                FCLCON5bits.FLTMOD = 0x0;
                break;       
        case PWM_GENERATOR_6:
                FCLCON6bits.FLTMOD = 0x0;
                break;       
        default:break;    
    }
}

/**
  @Summary
    Disables PWM latched fault mode for the PWM Generator selected by the 
    argument PWM_GENERATOR.

  @Description
    This routine is used to disable PWM latched fault mode for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_FaultModeLatchDisable(genNum);
    </code>
*/  
inline static void PWM_FaultModeLatchDisable(PWM_GENERATOR genNum)
{
    switch(genNum) { 
        case PWM_GENERATOR_1: 
                FCLCON1bits.FLTMOD = 0x3;
                break;       
        case PWM_GENERATOR_2: 
                FCLCON2bits.FLTMOD = 0x3;
                break;       
        case PWM_GENERATOR_3: 
                FCLCON3bits.FLTMOD = 0x3;
                break;       
        case PWM_GENERATOR_4: 
                FCLCON4bits.FLTMOD = 0x3;
                break;       
        case PWM_GENERATOR_5: 
                FCLCON5bits.FLTMOD = 0x3;
                break;       
        case PWM_GENERATOR_6: 
                FCLCON6bits.FLTMOD = 0x3;
                break;       
        default:break;   
    }   
}

/**
  @Summary
    Callback for PWM Special Event.

  @Description
    This routine is callback for PWM Special Event

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_SpecialEvent_CallBack();
    </code>
*/
void PWM_SpecialEvent_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_SpecialEvent_Tasks();
    </code>
    
*/
void PWM_SpecialEvent_Tasks(void);

/**
  @Summary
    Callback for PWM Generator1.

  @Description
    This routine is callback for PWM Generator1

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator1_CallBack();
    </code>
*/
void PWM_Generator1_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator1_Tasks();
    </code>   
*/
void PWM_Generator1_Tasks(void);

/**
  @Summary
    Callback for PWM Generator2.

  @Description
    This routine is callback for PWM Generator2

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator2_CallBack();
    </code>
*/
void PWM_Generator2_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator2_Tasks();
    </code>   
*/
void PWM_Generator2_Tasks(void);

/**
  @Summary
    Callback for PWM Generator3.

  @Description
    This routine is callback for PWM Generator3

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator3_CallBack();
    </code>
*/
void PWM_Generator3_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator3_Tasks();
    </code>   
*/
void PWM_Generator3_Tasks(void);

/**
  @Summary
    Callback for PWM Generator4.

  @Description
    This routine is callback for PWM Generator4

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator4_CallBack();
    </code>
*/
void PWM_Generator4_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator4_Tasks();
    </code>   
*/
void PWM_Generator4_Tasks(void);

/**
  @Summary
    Callback for PWM Generator5.

  @Description
    This routine is callback for PWM Generator5

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator5_CallBack();
    </code>
*/
void PWM_Generator5_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator5_Tasks();
    </code>   
*/
void PWM_Generator5_Tasks(void);

/**
  @Summary
    Callback for PWM Generator6.

  @Description
    This routine is callback for PWM Generator6

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator6_CallBack();
    </code>
*/
void PWM_Generator6_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator6_Tasks();
    </code>   
*/
void PWM_Generator6_Tasks(void);


